# Creating Dataframes

In [5]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

### with an array of tuples

In [3]:
# test plotting from multi-index
df1 = pd.DataFrame([
        ('Q1','Blue',100),
        ('Q1','Green',300),
        ('Q2','Blue',200),
        ('Q2','Green',350),
        ('Q3','Blue',300),
        ('Q3','Green',400),
        ('Q4','Blue',400),
        ('Q4','Green',450),
    ], 
    columns=['quarter', 'company', 'value']
)
df1.head()

  quarter company  value
0      Q1    Blue    100
1      Q1   Green    300
2      Q2    Blue    200
3      Q2   Green    350
4      Q3    Blue    300

### with a dict of arrays

In [4]:
df2 = pd.DataFrame({
  'Year': [2015, 2016, 2017, 2018],
    'Jan': [9, 17, 12, 3],
    'Feb': [2, 3, 9, 14],
    'Mar': [12, 15, 7, 2]
})
df2

   Year  Jan  Feb  Mar
0  2015    9    2   12
1  2016   17    3   15
2  2017   12    9    7
3  2018    3   14    2

### with random numbers

In [11]:
df3 = pd.DataFrame(np.random.randint(0, 100, size=(10, 4)), columns=list('ABCD'))
df3

    A   B   C   D
0  49  56  18  61
1  90  64  76  65
2  85  90  71  28
3  99  84  64  68
4   5  94  28  77
5   5  19  46  61
6  63  33  36  81
7  97  28  88   7
8  46  73  74  28
9  12  20  91   6

### create a range of dates

In [2]:
datetime(2022, 6, 24)

datetime.datetime(2022, 6, 24, 0, 0)

In [6]:
np.arange(datetime(2022, 6, 24), datetime(2022, 9, 17), timedelta(days=7))

array(['2022-06-24T00:00:00.000000', '2022-07-01T00:00:00.000000',
       '2022-07-08T00:00:00.000000', '2022-07-15T00:00:00.000000',
       '2022-07-22T00:00:00.000000', '2022-07-29T00:00:00.000000',
       '2022-08-05T00:00:00.000000', '2022-08-12T00:00:00.000000',
       '2022-08-19T00:00:00.000000', '2022-08-26T00:00:00.000000',
       '2022-09-02T00:00:00.000000', '2022-09-09T00:00:00.000000',
       '2022-09-16T00:00:00.000000'], dtype='datetime64[us]')